1. Import the data file from your PC.

In [2]:
import pandas as pd
import numpy as np
df = pd.read_csv(r"D:\PYTON PROGRAMMING\PYTHON FILES\PANDAS\Automobile_data.csv")

2. Print the data file.

In [ ]:
print(df.info())

3. Print first 4 rows and the last 4 rows of the data file.

In [ ]:
df.head(4)  #Prints the first 4 rows.
df.tail(4)  #Prints the last 4 rows.

4. Print company and price column only.

In [ ]:
df[['company','price']]

5. Print all the cars from bmw and alfa-romero company which have price over 15000.

In [ ]:
df[((df['company'] == 'alfa-romero') | (df['company'] == 'bmw')) & (df['price'] > 15000)]

6. Change the price of car at row 15 to 12000

In [ ]:
df.loc[15,'price'] = 12000
print(df.loc[15])

7. Sum the entire price column.

In [60]:
print(df.sum()['price'])

897871.0

7. Print average car price of each company.

In [ ]:
df.groupby('company')['price'].agg('mean')

8. Print number of cars from each company.

In [ ]:
df.groupby('company')['index'].count()

9. Print all the car comapny that starts with a.

In [ ]:
df[df['company'].str.startswith('a')]

10. Arrange the data on the basis of price.

In [ ]:
df.sort_values(['price'], ascending=[0])

11. Print all the rows which have atleast one NaN value.

In [17]:
df[df.isna().any(axis=1)]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN

12. Remove all the NaN value from the Dataframe.

In [ ]:
df1 = df.dropna()   #This will drop all the NaN values from the datafame.
df2 = df.dropna(how= any)   #this will  drop the entire row if one value is NaN.
df3 = df.dropna(how = all)  #This will drop the enire row only of all the values of the row is NaN.

Fill the place of NaN with some other values.

In [ ]:
df.fillna(method='pad')  #This will fill the null value with a value just above to that cell.
df.fillna(method='bfill')   #This will fill the null cell with a value just below to that cell.
df.fillna(method='pad',axis=1)  #This will fill the null value with a value just left to that cell.
df.fillna(method='bfill', axis=1)   #This will fill the null cell with a value just right to that cell.

13. Replace a word with another.

In [ ]:
df['num-of-cylinders'] = df['num-of-cylinders'].replace({'four': 'eight'}, inplace=False)
print(df['num-of-cylinders'])

14. Filter Out value if the same exist just before it.

In [ ]:
a = pd.DataFrame({'A' : [1,1,2,3,2,3,4,5,5,5,6,7,7]}) 
my_list = a['A'].tolist()       #This will convert the dataframe into a list.
new_list = [my_list[0]]

for i in range (1,len(my_list)):
    if my_list[i] != my_list[i-1]:
        new_list.append(my_list[i])

a = pd.DataFrame(new_list, columns=['A'])       #This will again convert the list into dataframe.
a

15. How do you subtract the row mean from each element in the row

In [ ]:
b = pd.DataFrame(np.random.random(size=(5,3)))   #creates a table of 5 row and 3 columns.
b.mean(axis=1)  #Calculates the mean of the values in the table along the rows(Axis = 1).
print(b - b.mean())

16. Suppose you have a data frame of 10 columns and 5 rows, Then print which column has the smallest sum.

In [12]:
r = pd.DataFrame(np.random.random(size=(5,10)),columns=list('abcdefghij'))
r.sum(axis=0).idxmin()

'a'

17. How do you count how many unique rows a DataFrame has?

In [ ]:
df = pd.DataFrame(np.random.randint(0,2,size=(10,3)),index=list('abcdefghij'))
print(df)
nums = df.values.tolist()
unique_value = set(tuple(num) for num in nums)
unique_value_list = list(unique_value)
print(len(unique_value))